intern_activites/week2.tex
% Created 2021-06-20 Sun 18:30
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{Week 2 Activity}
\hypersetup{
 pdfauthor={},
 pdftitle={Week 2 Activity},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.6)},
 pdflang={English}}
\begin{document}

\maketitle

\section*{Objectives for this week}
\label{sec:org709a4b8}
\subsection*{{\bfseries\sffamily TODO} Send media data between two local browsers.}
\label{sec:org00dbd0a}
\subsection*{{\bfseries\sffamily TODO} Send text data between two remote browsers}
\label{sec:org1cf59a0}
\subsection*{{\bfseries\sffamily TODO} Send media data between two remote browers.}
\label{sec:org3a182fa}

\section*{Activites done this week}
\label{sec:org8d0e47c}
\subsection*{Day 1}
\label{sec:org3536abd}
\subsubsection*{Working Time}
\label{sec:org8e77d75}
\textit{<2021-06-14 Mon 09:45> } to \textit{<2021-06-14 Mon 02:45>}

\subsubsection*{Things done}
\label{sec:orgb4e2d7e}
\begin{itemize}
\item Started working on sending media data between two browsers.
\item Coded up a sample webpage for streaming webcam video data.
\end{itemize}

\subsection*{Day 2}
\label{sec:org05bd1d2}

\subsubsection*{Working Time}
\label{sec:org468ba08}
\textit{<2021-06-15 Tue 09:45> } to \textit{<2021-06-15 Tue 02:45>}

\subsubsection*{Things done}
\label{sec:org3274b15}
\begin{itemize}
\item Tried to send localStream to localConnection using addTrack fucntion
\item Started on the implementation looking at these videos from this \href{https://www.youtube.com/playlist?list=PLsOU6EOcj51fvJK7Z5sb5qM57NU8vYhTy}{playlist}.
\end{itemize}

\subsection*{Day 3}
\label{sec:orgc805da6}

\subsubsection*{Working Time}
\label{sec:org7868d0e}
\noindent\rule{\textwidth}{0.5pt}

\subsubsection*{Things done}
\label{sec:orgec31d0b}
\begin{itemize}
\item Could not work on anything because of, travel schedule to kolkata, whole day got
spent on this.
\end{itemize}

\subsection*{Day 4}
\label{sec:org6ff3107}

\subsubsection*{Working Time}
\label{sec:org2afa51b}
\textit{<2021-06-17 Thu 10:20> } to \textit{<2021-06-17 Thu 04:00>}

\subsubsection*{Things done}
\label{sec:org77947c3}
\begin{itemize}
\item Errors crept up while implementing the solution from youtube videos,
due to unforseen reasons, the code just did not work on my machine.
\item Due to my low grasp of JS had to spent the whole day refreshing important
JS concepts which are mainly needed for node.js
watched this \href{https://www.youtube.com/watch?v=NCwa\_xi0Uuc}{video}.
\end{itemize}

\subsection*{Day 5}
\label{sec:org4744ff2}
\subsubsection*{Working Time}
\label{sec:org25e7a01}
\textit{<2021-06-25 Fri 10:15> } to \textit{<2021-06-25 Fri 17:20>}

\subsubsection*{Things done}
\label{sec:org719753b}
\begin{itemize}
\item Started working on a different implementation watching this \href{https://www.youtube.com/watch?v=DvlyzDZDEq4\&t=790s}{video}
\item Learned about peer.js which is a wrapper around webRTC to make things simple
\end{itemize}

\section*{Obejectives for next week}
\label{sec:org94fbb92}
\textbf{Same as this week}.
\end{document}